pitzDailySteady/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       8100;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       8200;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       8300;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1200;
        startFace       8700;
    }
)

// ************************************************************************* //
